import numpy as np

dataset = [
    ([1, 1], 1),
    ([1, 2], 2),
    ([1, 3], 3),
    ([1, 4], 4),
    ([1, 5], 5),
    ([1, 6], 6),
    ([1, 7], 7),
    ([1, 8], 8),
    ([1, 9], 9),
    ([1, 10], 10),
    ([2, 1], 2),
    ([2, 2], 4),
    ([2, 3], 6),
    ([2, 4], 8),
    ([2, 5], 10),
    ([2, 6], 12),
    ([2, 7], 14),
    ([2, 8], 16),
    ([2, 9], 18),
    ([2, 10], 20),
    ([3, 1], 3),
    ([3, 2], 6),
    ([3, 3], 9),
    ([3, 4], 12),
    ([3, 5], 15),
    ([3, 6], 18),
    ([3, 7], 21),
    ([3, 8], 24),
    ([3, 9], 27),
    ([3, 10], 30),
    ([4, 1], 4),
    ([4, 2], 8),
    ([4, 3], 12),
    ([4, 4], 16),
    ([4, 5], 20),
    ([4, 6], 24),
    ([4, 7], 28),
    ([4, 8], 32),
    ([4, 9], 36),
    ([4, 10], 40),
    ([5, 1], 5),
    ([5, 2], 10),
    ([5, 3], 15),
    ([5, 4], 20),
    ([5, 5], 25),
    ([5, 6], 30),
    ([5, 7], 35),
    ([5, 8], 40),
    ([5, 9], 45),
    ([5, 10], 50),
    ([6, 1], 6),
    ([6, 2], 12),
    ([6, 3], 18),
    ([6, 4], 24),
    ([6, 5], 30),
    ([6, 6], 36),
    ([6, 7], 42),
    ([6, 8], 48),
    ([6, 9], 54),
    ([6, 10], 60),
    ([7, 1], 7),
    ([7, 2], 14),
    ([7, 3], 21),
    ([7, 4], 28),
    ([7, 5], 35),
    ([7, 6], 42),
    ([7, 7], 49),
    ([7, 8], 56),
    ([7, 9], 63),
    ([7, 10], 70),
    ([8, 1], 8),
    ([8, 2], 16),
    ([8, 3], 24),
    ([8, 4], 32),
    ([8, 5], 40),
    ([8, 6], 48),
    ([8, 7], 56),
    ([8, 8], 64),
    ([8, 9], 72),
    ([8, 10], 80),
    ([9, 1], 9),
    ([9, 2], 18),
    ([9, 3], 27),
    ([9, 4], 36),
    ([9, 5], 45),
    ([9, 6], 54),
    ([9, 7], 63),
    ([9, 8], 72),
    ([9, 9], 81),
    ([9, 10], 90),
    ([10, 1], 10),
    ([10, 2], 20),
    ([10, 3], 30),
    ([10, 4], 40),
    ([10, 5], 50),
    ([10, 6], 60),
    ([10, 7], 70),
    ([10, 8], 80),
    ([10, 9], 90),
    ([10, 10], 100),
]

b1 = np.array([1.1, 1.0])
b2 = np.array([0.1])

W1 = np.array([[0.5, 1.9], [1, 1.3]])

W2 = np.array([1.7, 2])


def main(W1, W2, b1, b2):

    x1 = int(input("x1: "))
    x2 = int(input("x2: "))
    x = np.array([x1, x2])  # вектор входных данных
    z = layer(x, W1, b1)
    za = activation(z)
    z2 = second_layer(za, W2, b2)
    print(z2 * 10)


def layer(x, W1, b1):
    z = x @ W1 + b1
    return z


def activation(z):
    za = np.maximum(0, z)
    return za  # во второй слой передаються активированный нейроны


def second_layer(za, W2, b2):
    z2 = za @ W2 + b2
    return z2


def L(z, y):  # функция лосса
    return (z[0] - (y/10)) ** 2


def pr(pred, y, x, za, z, W3, b1, b2):
    proizLoss = 2 * (pred - (y / 10))  # производная лосса по предиктион

    dprW2 = proizLoss * za  # градиент по weight второго слоя
    dprZ1 = (proizLoss * W2) * (z > 0)  # производная для весов 1 слоя через веса 2
    dprW1 = np.outer(x, dprZ1)
    b2 = proizLoss
    b1 = dprZ1
    return dprW1, dprW2, b1, b2


def train(W1, W2, b1, b2):
    loss = 10
    iter = 1
    lr = 0.0001

    while loss >= 0.01 and iter <= 25000:
        total_loss = 0
        for x, y in dataset:
            z = layer(x, W1, b1)
            za = activation(z)
            z2 = second_layer(za, W2, b2)
            sample_loss = L(z2, y)
            dprW1, dprW2, dprb1, dprb2 = pr(z2, y, x, za, z, W2, b1, b2)
            W2 -= lr * dprW2
            W1 -= lr * dprW1
            b1 -= lr * dprb1
            b2 -= lr * dprb2
            total_loss += sample_loss
        loss = total_loss / len(dataset)

        iter += 1
        if iter % 1000 == 0:
            print(f"loss: {loss}")
            lr *= 0.95
            print(f"iteration: {iter - 1}")

    print("обучения закончно")
    while True:
        main(W1, W2, b1, b2)


if __name__ == "__main__":
    train(W1, W2, b1, b2)
